// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      新核科技(广州)有限公司
//
//      Copyright (C) 2022 CoreKernel Technology Guangzhou Co., Ltd
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      无限长单位冲激响应滤波器
//
//      2022年04月26日
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
/*
 *    数字信号处理函数库
 *
 *    纯算法示例可以在软件仿真环境下测试(CCSv5 以上版本均不再支持软件仿真)
 *
 *    - 希望缄默(bin wang)
 *    - bin@corekernel.net
 *
 *    官网 corekernel.net/.org/.cn
 *    社区 fpga.net.cn
 *
 */
#include <stdio.h>
#include <string.h>

#include <math.h>

#include "mathlib.h"

#include "dsplib.h"

// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      宏定义
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// 软件断点
#define SW_BREAKPOINT     asm(" SWBP 0 ");

// 采样点数
#define N   1024

// 采样频率
#define Fs  1024.0

// 滤波器阶数
#define NH  5

// π 及 浮点数极小值
#define PI                3.14159
#define F_TOL             (1e-06)

// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      全局变量
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#pragma DATA_ALIGN(IIRIn, 8);
float IIRIn[N];

#pragma DATA_ALIGN(IIROut, 8);
float IIROut[N + 4];

// IIR 延迟
#pragma DATA_ALIGN(IIRDelay, 8);
float IIRDelay[N + 4];

// 滤波器系数
// 通过 MATLAB 数字信号处理工具箱 Filter Design &  Analysis Tool 生成
// 滑动平均系数
const int NL = 9;

#pragma DATA_ALIGN(NUM, 8);
const float NUM[9] = {0.0185630098, 0.07425203919, 0.1113780662, 0.07425203919, 0.0185630098};

// 自回归系数
const int DL = 9;

#pragma DATA_ALIGN(DEN, 8);
const float DEN[9] = {1, -1.570398808, 1.275613308, -0.4844033718, 0.07619706541};

// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      主函数
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
int main()
{
    // 生成信号
    unsigned int i;
    for(i = 0; i < N; i++)
    {
        IIRIn[i + NH / 2] = 5 * sinsp(2 * PI * 100 * (i / Fs)) + 10 * sinsp(2 * PI * 450 * (i / Fs));
    }

    // IIR 滤波 低通(滤除 450Hz 信号)
    memset(IIRDelay, 0, sizeof(IIRDelay));

    DSPF_sp_iir(IIRDelay, IIRIn, IIROut, NUM, DEN, N + 4);

    // 断点
    SW_BREAKPOINT;
}
